{
  "version": "1.0.0",
  "description": "8x5 Business Model Pain Discovery Matrix - Maps specific vulnerabilities by model and dimension",
  "matrix": {
    "1_comercio_hibrido": {
      "TRD": {
        "pain_point": "Digital channel downtime forces customers to physical stores, creating operational chaos",
        "root_cause": "Hybrid operations create dependencies without redundancy planning",
        "light_question": "Si tu e-commerce cae ahora mismo, ¿cuántas horas hasta que tus tiendas físicas colapsen por la demanda?",
        "premium_questions": [
          "¿Qué % de clientes digitales tienen las tiendas físicas capacidad de absorber?",
          "¿Cuánto inventario se maneja exclusivamente online vs tiendas?",
          "¿Pueden las tiendas operar sin acceso a sistemas centrales?",
          "¿Cómo se comunican promociones digitales a equipos de tienda?"
        ],
        "interpretation": "Reveals if they understand cross-channel operational dependencies"
      },
      "AER": {
        "pain_point": "Digital operations expose high-value data while generating fraction of revenue",
        "root_cause": "Security investment follows technology adoption, not revenue protection",
        "light_question": "¿Qué % de tus ingresos viene del canal digital, pero qué % de tu presupuesto de seguridad lo protege?",
        "premium_questions": [
          "¿Cuál es el valor de la base de datos de clientes accesible online?",
          "¿Qué costaría más: perder e-commerce 1 semana o data de clientes?",
          "¿Los mismos sistemas protegen operaciones de $5K/hora y $50K/hora?",
          "¿Cuánto pagarías para evitar que competidores accedan a tu data de precios?"
        ],
        "interpretation": "Exposes misalignment between digital risk and revenue contribution"
      },
      "HFP": {
        "pain_point": "Store employees with system access become weakest security link",
        "root_cause": "High rotation staff with minimal training accessing critical systems",
        "light_question": "¿Cuántos empleados de tienda pueden aprobar devoluciones mayores a $500, y cuándo fue su última capacitación de seguridad?",
        "premium_questions": [
          "¿Qué % de rotación anual tienen los empleados con acceso a sistemas?",
          "¿Cuántos ex-empleados de los últimos 6 meses aún podrían tener accesos?",
          "¿Un empleado de tienda puede acceder a data de otras sucursales?",
          "¿Cómo detectarías si un empleado está filtrando data de clientes?"
        ],
        "interpretation": "Shows if they grasp human risk in distributed operations"
      },
      "BRI": {
        "pain_point": "Point-of-sale compromise can spread to entire inventory and financial systems",
        "root_cause": "Retail systems interconnected for efficiency, not isolation",
        "light_question": "Si comprometen una caja registradora, ¿a qué % de tus sistemas críticos podría llegar un atacante?",
        "premium_questions": [
          "¿Las cajas tienen acceso directo a sistemas de inventario central?",
          "¿Un malware en POS puede alcanzar sistemas contables?",
          "¿Están segmentadas las redes de tiendas entre sí?",
          "¿Qué sistemas comparten credenciales con los POS?"
        ],
        "interpretation": "Reveals understanding of retail attack propagation paths"
      },
      "RRG": {
        "pain_point": "Recovery plans assume both channels work, reality shows interdependencies",
        "root_cause": "DR plans tested in isolation, not considering business operations",
        "light_question": "Tu plan dice recuperar en 4 horas, pero ¿cuándo fue la última vez que recuperaste operaciones con clientes reales comprando?",
        "premium_questions": [
          "¿Pueden las tiendas procesar ventas si el e-commerce está en recovery?",
          "¿Cómo manejas inventory sync durante una recuperación parcial?",
          "¿Qué pasa con órdenes en tránsito durante un failover?",
          "¿Has probado recuperación en época de alta demanda?"
        ],
        "interpretation": "Exposes gap between technical recovery and business continuity"
      }
    },
    "2_software_critico": {
      "TRD": {
        "pain_point": "Customer churn accelerates exponentially after 2 hours of downtime",
        "root_cause": "SaaS customers have zero tolerance for critical tool failures",
        "light_question": "Si tu servicio falla ahora, ¿cuántos clientes empezarían a buscar alternativas después de 2 horas?",
        "premium_questions": [
          "¿Cuál es tu churn rate mensual normal vs durante incidentes?",
          "¿Qué % de revenue está en riesgo por SLAs incumplidos?",
          "¿Cuántos clientes pueden operar sin tu herramienta por 24h?",
          "¿Tienes competidores esperando para capturar clientes frustrados?"
        ],
        "interpretation": "Reveals if they understand customer patience limits"
      },
      "AER": {
        "pain_point": "Multi-tenant architecture means one breach affects all customers",
        "root_cause": "Efficiency design makes attractive target for data harvesting",
        "light_question": "Si un atacante compromete un tenant, ¿qué impide que acceda a datos de todos tus clientes?",
        "premium_questions": [
          "¿Cuál es el valor agregado de datos de todos tus clientes?",
          "¿Qué costaría una demanda colectiva por breach de datos?",
          "¿Los clientes enterprise tienen aislamiento real o lógico?",
          "¿Cuánto vale tu propiedad intelectual del código fuente?"
        ],
        "interpretation": "Shows grasp of multi-tenant risk amplification"
      },
      "HFP": {
        "pain_point": "Developers with production access are prime social engineering targets",
        "root_cause": "Speed of deployment vs security controls in CI/CD",
        "light_question": "¿Cuántos developers pueden hacer deploy a producción, y cuántos han sido testeados contra phishing este año?",
        "premium_questions": [
          "¿Un developer comprometido puede insertar backdoors sin review?",
          "¿Qué controles previenen commits maliciosos de cuentas válidas?",
          "¿Los secrets de producción están en laptops de developers?",
          "¿Ex-empleados técnicos mantienen acceso a repos o sistemas?"
        ],
        "interpretation": "Exposes human vulnerabilities in development pipeline"
      },
      "BRI": {
        "pain_point": "API compromise grants access to entire customer ecosystem",
        "root_cause": "APIs designed for functionality, not zero-trust isolation",
        "light_question": "Con una API key comprometida, ¿qué % de funcionalidades críticas puede ejecutar un atacante?",
        "premium_questions": [
          "¿Las API keys tienen granularidad por función o son full-access?",
          "¿Cómo detectas uso anormal de APIs válidas?",
          "¿Un cliente comprometido puede afectar a otros vía API?",
          "¿Qué datos son accesibles vía API vs UI?"
        ],
        "interpretation": "Reveals API security maturity and blast containment"
      },
      "RRG": {
        "pain_point": "Rollback procedures break customer data and integrations",
        "root_cause": "Recovery focused on infrastructure, not application state",
        "light_question": "Si necesitas hacer rollback a hace 24 horas, ¿cuántas transacciones de clientes se perderían?",
        "premium_questions": [
          "¿Cómo manejas data consistency en recovery parcial?",
          "¿Los webhooks y integraciones se re-sincronizan automáticamente?",
          "¿Clientes deben re-hacer trabajo perdido post-recovery?",
          "¿Has probado recovery con clientes activamente usando el sistema?"
        ],
        "interpretation": "Shows understanding of application-level recovery complexity"
      }
    },
    "3_servicios_datos": {
      "TRD": {
        "pain_point": "Data freshness degrades value exponentially - stale data equals zero revenue",
        "root_cause": "Business model depends on real-time information delivery",
        "light_question": "Si tus sistemas de ingesta de datos fallan, ¿en cuántas horas tu información pierde 50% de su valor para clientes?",
        "premium_questions": [
          "¿Qué % de clientes pagan por data real-time vs histórica?",
          "¿Cómo afecta 1 hora de retraso a decisiones de tus clientes?",
          "¿Tienes SLAs de freshness con penalizaciones económicas?",
          "¿Competidores pueden capitalizar tu downtime?"
        ],
        "interpretation": "Reveals if they understand time-value degradation of data"
      },
      "AER": {
        "pain_point": "Entire business value concentrated in datasets makes perfect ransom target",
        "root_cause": "Unlike other businesses, data IS the product",
        "light_question": "Si un ransomware encripta tu data lake principal, ¿cuál sería el monto máximo de rescate que considerarías pagar?",
        "premium_questions": [
          "¿Cuál es el valor de reemplazo de tus datasets propietarios?",
          "¿Qué % de tu data es irreemplazable o única?",
          "¿Los respaldos incluyen todas las transformaciones y modelos?",
          "¿Cuánto costaría reconstruir 5 años de datos históricos?"
        ],
        "interpretation": "Exposes understanding of data as irreplaceable asset"
      },
      "HFP": {
        "pain_point": "Data analysts with query access can exfiltrate entire business value",
        "root_cause": "Business requires broad data access for analysis",
        "light_question": "¿Cuántos analistas pueden ejecutar queries que retornen más de 1 millón de registros sensitivos?",
        "premium_questions": [
          "¿Cómo detectas exfiltración vía queries legítimas?",
          "¿Los analistas pueden ver data en crudo o solo agregada?",
          "¿Trackeas qué empleado accedió qué datasets sensibles?",
          "¿Un analista puede descargar tu ventaja competitiva completa?"
        ],
        "interpretation": "Shows controls over legitimate access abuse"
      },
      "BRI": {
        "pain_point": "One breach exposes all customer segments and data products",
        "root_cause": "Data lakes optimize for analysis, not compartmentalization",
        "light_question": "Si comprometen credenciales de tu data warehouse, ¿qué % de todos tus productos de datos quedan expuestos?",
        "premium_questions": [
          "¿Están segregados datasets por cliente o valor sensitivity?",
          "¿Un breach puede exponer tanto data pública como premium?",
          "¿Los modelos de ML y algoritmos están en el mismo ambiente?",
          "¿Cómo limitas blast radius en arquitecturas de big data?"
        ],
        "interpretation": "Reveals data architecture security maturity"
      },
      "RRG": {
        "pain_point": "Data pipeline recovery breaks all downstream analytics and products",
        "root_cause": "Complex ETL dependencies and data lineage",
        "light_question": "Si debes recuperar de backup de hace 48h, ¿cuántos procesos de transformación y modelos debes re-ejecutar?",
        "premium_questions": [
          "¿Tienes mapeado el lineage completo de cada data product?",
          "¿Cómo manejas inconsistencias temporales en recovery?",
          "¿Los modelos de ML necesitan re-entrenamiento post-recovery?",
          "¿Clientes notan gaps o inconsistencias en datos recuperados?"
        ],
        "interpretation": "Exposes complexity of data pipeline recovery"
      }
    },
    "4_ecosistema_digital": {
      "TRD": {
        "pain_point": "Platform downtime triggers cascade of partner business failures",
        "root_cause": "Ecosystem participants have no alternative channels",
        "light_question": "Si tu plataforma falla ahora, ¿cuántos minutos hasta que tus partners empiecen a perder dinero?",
        "premium_questions": [
          "¿Qué % del revenue de partners depende de tu uptime?",
          "¿Cuántos partners quebrarían con 48h de tu downtime?",
          "¿Tienes liability por pérdidas de terceros en tu ecosistema?",
          "¿Cómo priorizas recuperación entre diferentes tipos de partners?"
        ],
        "interpretation": "Reveals understanding of ecosystem economic dependencies"
      },
      "AER": {
        "pain_point": "Attack surface multiplied by every participant in ecosystem",
        "root_cause": "Security equals weakest partner, not platform controls",
        "light_question": "¿Cuántos de tus partners han tenido un assessment de seguridad en el último año?",
        "premium_questions": [
          "¿Un partner comprometido puede afectar a otros partners?",
          "¿Qué valor total es accesible vía el partner más débil?",
          "¿Monitoreas security posture de partners críticos?",
          "¿Cómo contienes breaches originados en terceros?"
        ],
        "interpretation": "Shows grasp of third-party risk amplification"
      },
      "HFP": {
        "pain_point": "Thousands of external users with platform access beyond company control",
        "root_cause": "Cannot enforce security training on ecosystem participants",
        "light_question": "¿Qué % de usuarios con acceso a tu plataforma son empleados de partners sobre los que no tienes control directo?",
        "premium_questions": [
          "¿Cómo verificas identidad real de usuarios de partners?",
          "¿Partners re-comparten accesos internamente sin tu conocimiento?",
          "¿Detectas comportamientos anómalos por tipo de partner?",
          "¿Un partner puede crear usuarios ilimitados?"
        ],
        "interpretation": "Exposes human risk beyond organizational boundaries"
      },
      "BRI": {
        "pain_point": "Platform compromise grants access to entire ecosystem transactions",
        "root_cause": "Central platform sees all ecosystem flows and data",
        "light_question": "Desde tu plataforma comprometida, ¿a qué % del volumen transaccional total del ecosistema puede acceder un atacante?",
        "premium_questions": [
          "¿Toda la data transaccional pasa por tus sistemas centrales?",
          "¿Partners pueden operar P2P sin tu intermediación?",
          "¿Segregas data por verticales o geografías?",
          "¿Un breach expondría estrategias de todos los participantes?"
        ],
        "interpretation": "Reveals platform centralization risks"
      },
      "RRG": {
        "pain_point": "Recovery requires coordinating hundreds of ecosystem participants",
        "root_cause": "No single party controls full recovery process",
        "light_question": "En tu último incidente, ¿cuántas horas tomó solo notificar a todos los partners afectados?",
        "premium_questions": [
          "¿Tienes runbooks de recovery coordinada con partners tier 1?",
          "¿Cómo sincronizas estado post-recovery entre participantes?",
          "¿Partners tienen sus propios planes que conflictúan con el tuyo?",
          "¿Has simulado recovery con partners activos simultáneamente?"
        ],
        "interpretation": "Shows ecosystem coordination complexity"
      }
    },
    "5_servicios_financieros": {
      "TRD": {
        "pain_point": "Every second of downtime means lost transactions and regulatory scrutiny",
        "root_cause": "Zero tolerance for financial service interruption",
        "light_question": "Si tus sistemas de pago fallan en este momento, ¿cuántos segundos hasta que empieces a incumplir regulaciones?",
        "premium_questions": [
          "¿Cuál es tu pérdida por minuto en hora pico?",
          "¿Qué multas aplican por indisponibilidad de servicios críticos?",
          "¿Tienes que compensar a clientes por downtime?",
          "¿Cómo impacta el downtime tu licencia operativa?"
        ],
        "interpretation": "Reveals true cost of financial service interruption"
      },
      "AER": {
        "pain_point": "Direct access to money makes you prime target for organized crime",
        "root_cause": "Unlike other data, financial access equals immediate monetization",
        "light_question": "¿Cuál es el monto máximo que un atacante podría transferir con credenciales comprometidas de un solo empleado?",
        "premium_questions": [
          "¿Qué controles previenen transferencias masivas automatizadas?",
          "¿Cuánto podrían robar antes de detección en fin de semana?",
          "¿Están asegurados todos los tipos de fraude cibernético?",
          "¿Qué % de transacciones requieren validación humana?"
        ],
        "interpretation": "Exposes monetary controls and limits"
      },
      "HFP": {
        "pain_point": "Employees with money movement capabilities are worth fortunes to criminals",
        "root_cause": "Financial authorization requires human judgment calls",
        "light_question": "¿Cuántos empleados pueden aprobar transferencias superiores a $100K, y cuándo fue su último polígrafo o background check?",
        "premium_questions": [
          "¿Monitoreas situación financiera personal de empleados críticos?",
          "¿Qué previene colusión entre empleados con dual control?",
          "¿Detectas patrones de vida incompatibles con salarios?",
          "¿Empleados en stress financiero mantienen accesos críticos?"
        ],
        "interpretation": "Shows understanding of insider threat in financial context"
      },
      "BRI": {
        "pain_point": "Core banking compromise can drain all customer accounts",
        "root_cause": "Centralized systems for efficiency create single points of failure",
        "light_question": "Si comprometen tu core banking, ¿qué % del total de depósitos de clientes queda expuesto?",
        "premium_questions": [
          "¿Hay límites sistémicos para movimientos masivos?",
          "¿Cómo segregas cuentas retail vs corporate?",
          "¿Un breach puede afectar sistemas de otros productos?",
          "¿Están aislados ambientes de diferentes países/regulaciones?"
        ],
        "interpretation": "Reveals financial system compartmentalization"
      },
      "RRG": {
        "pain_point": "Recovery must be perfect - no transaction can be lost or duplicated",
        "root_cause": "Financial reconciliation requirements and audit trails",
        "light_question": "En tu última recuperación, ¿cuántas horas tomó reconciliar todas las transacciones para garantizar que no hubo duplicados ni pérdidas?",
        "premium_questions": [
          "¿Cómo garantizas atomicidad en recovery distribuido?",
          "¿Qué pasa con transacciones en vuelo durante failover?",
          "¿Tienes que re-procesar con contrapartes externas?",
          "¿Regulador debe aprobar antes de volver a operar?"
        ],
        "interpretation": "Exposes financial recovery complexity"
      }
    },
    "6_infraestructura_heredada": {
      "TRD": {
        "pain_point": "Legacy systems fail in cascade taking modern services with them",
        "root_cause": "Hidden dependencies between old and new systems",
        "light_question": "Si tu mainframe falla, ¿cuántos de tus servicios 'modernos' dejan de funcionar en minutos?",
        "premium_questions": [
          "¿Qué % de procesos críticos aún dependen de sistemas legacy?",
          "¿Están documentadas todas las interfaces legacy-modernas?",
          "¿Cuántos sistemas modernos son solo 'wrappers' del legacy?",
          "¿Puedes operar servicios nuevos sin el mainframe?"
        ],
        "interpretation": "Reveals true legacy dependencies"
      },
      "AER": {
        "pain_point": "Unpatched vulnerabilities in legacy make easy entry points",
        "root_cause": "Cannot update systems without breaking business operations",
        "light_question": "¿Cuántas vulnerabilidades críticas conocidas tienes en sistemas que no puedes parchear por ser legacy?",
        "premium_questions": [
          "¿Qué % de sistemas corren versiones sin soporte?",
          "¿Cuál es el costo de migrar vs riesgo de breach?",
          "¿Hay exploits públicos para tus sistemas legacy?",
          "¿Compensas con controles perimetrales solamente?"
        ],
        "interpretation": "Shows technical debt security impact"
      },
      "HFP": {
        "pain_point": "Only few veterans understand legacy, making them critical vulnerabilities",
        "root_cause": "Knowledge concentration in aging workforce",
        "light_question": "¿Cuántas personas realmente entienden tus sistemas legacy, y cuál es su edad promedio?",
        "premium_questions": [
          "¿Qué pasa cuando el experto en COBOL se jubila?",
          "¿Están documentados los procesos que 'solo Juan sabe'?",
          "¿Un extorsión al experto legacy paralizaría operaciones?",
          "¿Tienes sucesión planificada para conocimiento crítico?"
        ],
        "interpretation": "Exposes human single points of failure in legacy"
      },
      "BRI": {
        "pain_point": "Legacy compromise affects everything due to flat architectures",
        "root_cause": "Built before security segmentation was standard",
        "light_question": "Desde tu sistema legacy principal, ¿a cuántos otros sistemas se puede acceder sin autenticación adicional?",
        "premium_questions": [
          "¿El legacy tiene acceso directo a bases de datos modernas?",
          "¿Compartes credenciales entre legacy y nuevos sistemas?",
          "¿La red legacy está segmentada o es plana?",
          "¿Un malware en legacy puede saltar a sistemas modernos?"
        ],
        "interpretation": "Reveals legacy architecture security gaps"
      },
      "RRG": {
        "pain_point": "Recovery procedures assume technologies and skills that no longer exist",
        "root_cause": "Documentation frozen in time while reality evolved",
        "light_question": "Tu plan de recuperación menciona cintas y procedimientos de hace 10 años, ¿cuándo lo probaste completamente por última vez?",
        "premium_questions": [
          "¿Tienes hardware de respaldo para sistemas descontinuados?",
          "¿Los manuales de recovery están en tecnologías actuales?",
          "¿Puedes conseguir expertos en legacy en emergencia?",
          "¿Has probado recovery sin el equipo original?"
        ],
        "interpretation": "Shows gap between documented and executable recovery"
      }
    },
    "7_cadena_suministro": {
      "TRD": {
        "pain_point": "Digital tracking failure creates physical operation paralysis",
        "root_cause": "Physical operations now depend on digital visibility",
        "light_question": "Si tus sistemas de tracking fallan, ¿cuántas horas hasta que camiones y mercancía se 'pierdan' operacionalmente?",
        "premium_questions": [
          "¿Puedes despachar/recibir sin sistemas de tracking?",
          "¿Qué % de operaciones requieren confirmación digital?",
          "¿Los conductores pueden navegar sin sistemas?",
          "¿Clientes aceptan entregas sin tracking digital?"
        ],
        "interpretation": "Reveals digital dependency in physical operations"
      },
      "AER": {
        "pain_point": "Shipment data reveals business patterns worth millions to competitors",
        "root_cause": "Logistics data exposes customer relationships and volumes",
        "light_question": "Si un competidor accediera a tu data de envíos de 6 meses, ¿cuántos de tus top 10 clientes podría robarte?",
        "premium_questions": [
          "¿Qué revela tu data sobre contratos y pricing de clientes?",
          "¿Rutas y volúmenes exponen estrategias de negocio?",
          "¿La data incluye info de productos de clientes?",
          "¿Cuánto vale tu conocimiento de rutas optimizadas?"
        ],
        "interpretation": "Shows competitive value of logistics data"
      },
      "HFP": {
        "pain_point": "Distributed workforce with mobile devices accessing critical systems",
        "root_cause": "Field operations require broad access from insecure locations",
        "light_question": "¿Cuántos dispositivos móviles en campo pueden aprobar entregas de alto valor, y cuántos se han perdido este año?",
        "premium_questions": [
          "¿Conductores comparten dispositivos o credenciales?",
          "¿Qué pueden hacer con un dispositivo robado?",
          "¿Detectas accesos desde ubicaciones inusuales?",
          "¿BYOD tiene acceso a sistemas críticos?"
        ],
        "interpretation": "Exposes mobile workforce security gaps"
      },
      "BRI": {
        "pain_point": "Warehouse system compromise can manipulate entire inventory",
        "root_cause": "Integrated systems for efficiency create manipulation risks",
        "light_question": "Si comprometen tu WMS principal, ¿podrían redirigir embarques de alto valor sin detección?",
        "premium_questions": [
          "¿El WMS puede modificar destinos sin validación?",
          "¿Están segregados sistemas por valor de mercancía?",
          "¿Un malware puede propagar entre warehouses?",
          "¿Cambios en inventario requieren validación física?"
        ],
        "interpretation": "Reveals supply chain manipulation risks"
      },
      "RRG": {
        "pain_point": "Recovery desynchronizes physical and digital realities",
        "root_cause": "Physical goods continue moving during digital recovery",
        "light_question": "Si recuperas sistemas con 12 horas de atraso, ¿cómo reconcilias dónde está realmente cada envío?",
        "premium_questions": [
          "¿Cómo manejas envíos en tránsito durante recovery?",
          "¿Entregas completadas se pierden en rollback?",
          "¿Puedes re-sincronizar con sistemas de partners?",
          "¿La recovery incluye dispositivos móviles en campo?"
        ],
        "interpretation": "Shows physical-digital reconciliation complexity"
      }
    },
    "8_informacion_regulada": {
      "TRD": {
        "pain_point": "Medical/regulated service interruption risks lives and licenses",
        "root_cause": "Zero tolerance for unavailability in critical services",
        "light_question": "Si tus sistemas de historia clínica fallan durante una emergencia, ¿en cuántos minutos podrías enfrentar demandas por negligencia?",
        "premium_questions": [
          "¿Qué procedimientos médicos no pueden realizarse sin sistemas?",
          "¿Cuántas vidas dependen de tu uptime diario?",
          "¿Tienes respaldo en papel actualizado?",
          "¿Qué dice tu licencia sobre disponibilidad mínima?"
        ],
        "interpretation": "Reveals life-critical system dependencies"
      },
      "AER": {
        "pain_point": "Health/regulated data worth fortunes in black market",
        "root_cause": "Immutable personal data with lifelong value",
        "light_question": "¿Cuánto vale en el mercado negro el historial médico completo de tus pacientes, y cuántos tienes?",
        "premium_questions": [
          "¿Qué % de historiales incluyen data genética o mental?",
          "¿Los seguros pagarían rescate por data de pacientes?",
          "¿Cuántas celebridades o políticos son pacientes?",
          "¿Data incluye información vergonzosa o chantajeable?"
        ],
        "interpretation": "Exposes regulated data monetary value"
      },
      "HFP": {
        "pain_point": "Healthcare workers bypass security for patient care",
        "root_cause": "Life-saving priorities override security protocols",
        "light_question": "¿Cuántas veces al mes el personal médico comparte credenciales porque 'es una emergencia'?",
        "premium_questions": [
          "¿Médicos comparten logins en quirófanos?",
          "¿Enfermeras anotan passwords para turnos nocturnos?",
          "¿'Emergencia' justifica bypass de cualquier control?",
          "¿Cómo balanceas seguridad vs atención inmediata?"
        ],
        "interpretation": "Shows healthcare security culture reality"
      },
      "BRI": {
        "pain_point": "Medical systems interconnection means total hospital paralysis",
        "root_cause": "Integration for patient care creates total dependency",
        "light_question": "Si ransomware infecta tu PACS de radiología, ¿qué % del hospital deja de funcionar?",
        "premium_questions": [
          "¿Lab, farmacia y quirófanos dependen del mismo sistema?",
          "¿Un malware puede saltar entre departamentos?",
          "¿Están aislados sistemas de diferentes hospitales?",
          "¿Equipos médicos IoT están en la red principal?"
        ],
        "interpretation": "Reveals healthcare system interdependencies"
      },
      "RRG": {
        "pain_point": "Recovery cannot lose any patient data or face litigation",
        "root_cause": "Medical record integrity is legally mandated",
        "light_question": "En tu última recuperación, ¿cuántas horas tomó verificar que ningún dato de paciente se corrompió o perdió?",
        "premium_questions": [
          "¿Cómo garantizas integridad de prescripciones en recovery?",
          "¿Resultados de lab se pueden re-asociar correctamente?",
          "¿Auditorías regulatorias post-recovery qué requieren?",
          "¿Pacientes deben re-hacer estudios por data perdida?"
        ],
        "interpretation": "Exposes healthcare data integrity requirements"
      }
    }
  }
}